In [ ]:
#importing pandas

In [2]:
import pandas as pd

In [ ]:
#creating and viewing a DataFrame

In [3]:
data = {'Name':  ['Oh Il-Nam', 'Kang Sae-byeok', 'Jang Deok-su', 'Abdul Ali', 'Han Mi-nyeo', 'Cho Sang-woo', 'Ji-yeong'],
        'Number': [1, 67, 101, 199, 212, 218, 240],
        }

df = pd.DataFrame(data, index = ["player1", "player67", "player101", "player199", "player212", "player281", "player240"])

df.head(10)

                     Name  Number
player1         Oh Il-Nam       1
player67   Kang Sae-byeok      67
player101    Jang Deok-su     101
player199       Abdul Ali     199
player212     Han Mi-nyeo     212
player281    Cho Sang-woo     218
player240        Ji-yeong     240

In [ ]:
#viewing data from one row

In [4]:
print(df.loc["player67"])

Name      Kang Sae-byeok
Number                67
Name: player67, dtype: object

In [ ]:
#viewing data from one column

In [5]:
names = df.Name
names.head(10)

player1           Oh Il-Nam
player67     Kang Sae-byeok
player101      Jang Deok-su
player199         Abdul Ali
player212       Han Mi-nyeo
player281      Cho Sang-woo
player240          Ji-yeong
Name: Name, dtype: object

In [ ]:
#getting a count of values in each column

In [6]:
df.count()

Name      7
Number    7
dtype: int64

In [ ]:
#getting a count of values in one column and adding it to a variable

In [7]:
player_count = df['Name'].count()
player_count

7

In [ ]:
#adding a new row

In [8]:
df.loc['player456'] = ['Seong Gi-hun', 456]

In [ ]:
#viewing the new DataFrame

In [9]:
df.head(10)

                     Name  Number
player1         Oh Il-Nam       1
player67   Kang Sae-byeok      67
player101    Jang Deok-su     101
player199       Abdul Ali     199
player212     Han Mi-nyeo     212
player281    Cho Sang-woo     218
player240        Ji-yeong     240
player456    Seong Gi-hun     456

In [ ]:
#and a new count

In [10]:
df.count()

Name      8
Number    8
dtype: int64

In [ ]:
#adding a new column

In [11]:
df['Status'] = "Playing"

In [12]:
df

                     Name  Number   Status
player1         Oh Il-Nam       1  Playing
player67   Kang Sae-byeok      67  Playing
player101    Jang Deok-su     101  Playing
player199       Abdul Ali     199  Playing
player212     Han Mi-nyeo     212  Playing
player281    Cho Sang-woo     218  Playing
player240        Ji-yeong     240  Playing
player456    Seong Gi-hun     456  Playing

In [ ]:
#amending the value in a column

In [17]:
df.loc[df.Number == 240, "Status"] = "Eliminated"

In [18]:
df

                     Name  Number      Status
player1         Oh Il-Nam       1  Eliminated
player67   Kang Sae-byeok      67     Playing
player101    Jang Deok-su     101     Playing
player199       Abdul Ali     199  Eliminated
player212     Han Mi-nyeo     212     Playing
player281    Cho Sang-woo     218     Playing
player240        Ji-yeong     240  Eliminated
player456    Seong Gi-hun     456     Playing

In [ ]:
#creating a new DataFrame with deleted rows

In [22]:
round5 = df.drop(df.index[df['Status'] == "Eliminated"])

In [ ]:
#view the new DataFrame

In [23]:
round5.head()

                     Name  Number   Status
player67   Kang Sae-byeok      67  Playing
player101    Jang Deok-su     101  Playing
player212     Han Mi-nyeo     212  Playing
player281    Cho Sang-woo     218  Playing
player456    Seong Gi-hun     456  Playing

In [ ]:
#our original DataFrame with all rows

In [30]:
df.head(10)

                     Name  Number      Status
player1         Oh Il-Nam       1  Eliminated
player67   Kang Sae-byeok      67     Playing
player101    Jang Deok-su     101     Playing
player199       Abdul Ali     199  Eliminated
player212     Han Mi-nyeo     212     Playing
player281    Cho Sang-woo     218     Playing
player240        Ji-yeong     240  Eliminated
player456    Seong Gi-hun     456     Playing

In [ ]:
#use column counts to create new variables

In [19]:
eliminated = df[df['Status'] == "Eliminated"]['Name'].count()
playing = df[df['Status'] == "Playing"]['Name'].count()

In [ ]:
#make an f string with the variables

In [20]:
print(f"there are currently {playing} players playing")
print(f"there are currently {eliminated} players eliminated")

there are currently 5 players playing
there are currently 3 players eliminated

In [ ]:
#and a mathmatical function with the variables

In [21]:
total_players = 8

current = total_players - eliminated

current

5